// Lab_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#define _USE_MATH_DEFINES
#include <iostream>
#include<math.h>
using namespace std;

double check(int i) {
    double n = 1 / (i * (9 * pow(i, 2) - 1));
    double const eps = pow(10, -6);
    if (n < eps) {
        return 0;
    }
    return n;
}

void main()
{
    double const num = 1.5*(log(3)-1);
    double sum = 0;
    int i = 1;
    while(check(i)!=0){
        sum += check(i);
        i++;
    }
    cout << sum << endl;
    cout << num << endl;
    cout << ((sum == num) ? "true" : "false") << endl;
    system("PAUSE");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
